# brew bundle 
tap 'homebrew/dupes'
tap 'homebrew/core'

brew 'wget'
brew 'openssl'
brew 'htop'
brew 'memcached'
brew 'git'
brew 'ack'
brew 'ctags'

#bash
brew 'zsh'

#ruby
brew 'imagemagick'
brew 'rbenv'
brew 'rbenv-gemset' 
brew 'ruby-build'
brew 'ruby'
# brew 'qt5', args: ['with-qtwebkit'] #capybara-webkit 

# dev terminal env
brew 'tmux'
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']
brew 'vim', args: ['with-override-system-vi']

# dotfilesi
tap 'thoughtbot/formulae'
brew 'rcm'

#databases
# brew 'postgresql'
brew 'mysql'
brew 'mongodb'
brew 'redis'

# elixir and phoenix 
brew 'elixir'

#install cask
brew 'caskroom/cask/brew-cask'



